feat: extend Debezium's SMT Kafka Connector to promote JSON fields to individual headers
